Revit 2026 API

# CorrectionFactor Class

---

**Note: This API is now obsolete.**

Represents electrical correction factor information.

SystemObject Autodesk.Revit.DBAPIObject Autodesk.Revit.DB.ElectricalCorrectionFactor

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
[ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")]
public class CorrectionFactor : APIObject
```
```vb
<ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")>
Public Class CorrectionFactor
	Inherits APIObject
```
```cpp
[ObsoleteAttribute(L"CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")]
public ref class CorrectionFactor : public APIObject
```
```fsharp
[<ObsoleteAttribute("CorrectionFactor is deprecated in Revit 2026 and will be removed in a future version of Revit. There is no replacement because Revit no longer supports this.")>]
type CorrectionFactor =
    class
        inherit APIObject
    end
```

The CorrectionFactor type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Factor | Get factor value of wire correction factor. |
|  | IsReadOnly | Identifies if the object is read-only or modifiable.(Inherited from APIObject) |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Causes the object to release immediately any resources it may be utilizing.(Inherited from APIObject) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetTemperature | Get temperature which is used for specifying correction factor. The value returned is quantified in the document's selected unit of electrical temperature. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Correction factor is defined based on corresponding wire material type and temperature rating type.

#### Reference

Autodesk.Revit.DB.Electrical Namespace